import styles from '../Madrid/Madrid.module.scss';
import Rating from '@mui/material/Rating';
import Box from '@mui/material/Box';
import StarIcon from '@mui/icons-material/Star';
import { useState } from 'react';

const labels = {
    0.5: 'Useless',
    1: 'Useless+',
    1.5: 'Poor',
    2: 'Poor+',
    2.5: 'Ok',
    3: 'Ok+',
    3.5: 'Good',
    4: 'Good+',
    4.5: 'Excellent',
    5: 'Excellent+',
};

function getLabelText(value) {
    return `${value} Star${value !== 1 ? 's' : ''}, ${labels[value]}`;
}



export const Madrid = () => {

    const [value, setValue] = useState(2);
    const [hover, setHover] = useState(-1);

    return (
        <main className={styles.mainSite}>
            <section className={styles.mainSiteDescription}>
                <a name="description"><h1>Опис</h1></a>
                <div className={styles.mainSiteSectionOne}>
                    <div style={{ width: '66%' }}>
                        Мадри́д (ісп. Madrid) — столиця та найбільше місто Іспанії, адміністративний центр автономної спільноти Мадрид. Розташоване в центральній частині Піренейського півострова. Великий Мадрид є найбільшою міською агломерацією Південної Європи та займає агломерацію площею 1,2 тисячі км². Безпосередньо місто розташоване на території завбільшки 607 км² та включає 21 адміністративний район. Головна окраса столиці — Мадридський собор. Населення міста — 3 273 049 мешканців (2010 рік), а включаючи передмістя — понад 7 млн.
                        <div><Rating
                            name="hover-feedback"
                            value={value}
                            precision={0.5}
                            getLabelText={getLabelText}
                            onChange={(event, newValue) => {
                                setValue(newValue);
                            }}
                            onChangeActive={(event, newHover) => {
                                setHover(newHover);
                            }}
                            emptyIcon={<StarIcon style={{ opacity: 0.55 }} fontSize="inherit" />}
                        />
                            {value !== null && (
                                <Box style={{ marginBottom: '100px' }} sx={{ ml: 2 }}>{labels[hover !== -1 ? hover : value]}</Box>
                            )}</div>
                    </div>

                    <div style={{ display: 'flex', flexDirection: 'column' }}>
                        <a href="#description">Опис</a>
                        <a href="#map">Мапа</a>
                        <a href="#imgs">Місця</a>
                        <a href="#imgs1" style={{ padding: '5px', fontSize: '15px' }}>1. Музей Прадо</a>
                        <a href="#imgs2" style={{ padding: '5px', fontSize: '15px' }}>2. Центр мистецтв королеви Софії</a>
                        <a href="#imgs3" style={{ padding: '5px', fontSize: '15px' }}>3. Музей Тіссен-Борнемісса</a>

                    </div>

                </div>

            </section>
            <a name="map"><h1>Мапа</h1></a>
            <iframe src="https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d194347.4782999014!2d-3.8443433!3d40.4380986!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd422997800a3c81%3A0xc436dec1618c2269!2z0JzQsNC00YDQuNC0LCBNYWRyaWQsINCG0YHQv9Cw0L3RltGP!5e0!3m2!1suk!2sua!4v1671566417007!5m2!1suk!2sua" width="600" height="450" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
            <section>
                <a name="imgs"><h1>Місця</h1></a>
                <a name="imgs1"><h2>Музей Прадо</h2></a>
                <p>Почати свій візит в іспанську столицю варто з одного з найвідоміших музеїв не тільки країни, але і світу — Прадо. У цій скарбниці зібрана величезна колекція з понад 6 тисяч полотен, більше 400 скульптур, а також різних ювелірних виробів.</p>
                <img style={{
                    display: 'flex', justifyContent: 'center', marginTop: 0, marginRight: 'auto',
                    marginBottom: '10px',
                    marginLeft: 'auto',
                }} src="https://tripmydream.cc/travelhub/travel/block_gallery/90/361/default_90361.jpg?" alt="" />

                <p>У Прадо ви можете побачити роботи таких відомих іспанських майстрів, як Гойя, Веласкес і Ель Греко, а ще — полотна італійських і голландських живописців: Боттічеллі, Рафаеля, Тиціана, Рубенса, Ван Дейка та інших.

                    Музей працює щоденно, крім неділі, з 10:00 до 20:00. У неділю та свята — з 10:00 до 19:00. 1 січня, 1 травня і 25 грудня — вихідні дні. 24 і 31 грудня, а також 6 січня музей відкритий з 10:00 до 14:00.

                    Вартість квитка — €14. Для пенсіонерів старше 65, членів багатодітних сімей і власників молодіжних карток — €7. Для дітей до 18 років, студентів (18-25 років) і людей з обмеженими можливостями вхід вільний. Безкоштовно музей можна потрапити по неділях і за дві години до закриття.

                    Рада! Можна пристойно заощадити, якщо купити карту Paseo del Arte: вона дозволяє відвідати три найбільших музею Мадрида — Прадо, музей Тіссен-Борнемісса і музей королеви Софії — з 20% знижкою на квитки. Тим більше, що картка діє протягом року з моменту придбання.</p>
                <a name="imgs2"><h2>Центр мистецтв королеви Софії</h2></a>
                <p>В Рейну-Софія, на відміну від помпезного і традиційного Прадо, ви зможете ознайомитися з історією мистецтва ХХ століття до сьогодення. Зокрема, у музеї представлена велика колекція робіт авангардистів (Хуан Гріс, Пікассо) і сюрреалістів (Далі, Міро, Магрітт). Саме тут можна побачити знамениту «Герніку» Пабло Пікассо.</p>
                <img style={{
                    display: 'flex', justifyContent: 'center', marginTop: 0, marginRight: 'auto',
                    marginBottom: '10px',
                    marginLeft: 'auto',
                }} src="https://tripmydream.cc/travelhub/travel/block_gallery/90/362/default_90362.jpg?" alt="" />
                <p>У Прадо ви можете побачити роботи таких відомих іспанських майстрів, як Гойя, Веласкес і Ель Греко, а ще — полотна італійських і голландських живописців: Боттічеллі, Рафаеля, Тиціана, Рубенса, Ван Дейка та інших.

                    Музей працює щоденно, крім неділі, з 10:00 до 20:00. У неділю та свята — з 10:00 до 19:00. 1 січня, 1 травня і 25 грудня — вихідні дні. 24 і 31 грудня, а також 6 січня музей відкритий з 10:00 до 14:00.

                    Вартість квитка — €14. Для пенсіонерів старше 65, членів багатодітних сімей і власників молодіжних карток — €7. Для дітей до 18 років, студентів (18-25 років) і людей з обмеженими можливостями вхід вільний. Безкоштовно музей можна потрапити по неділях і за дві години до закриття.

                    Рада! Можна пристойно заощадити, якщо купити карту Paseo del Arte: вона дозволяє відвідати три найбільших музею Мадрида — Прадо, музей Тіссен-Борнемісса і музей королеви Софії — з 20% знижкою на квитки. Тим більше, що картка діє протягом року з моменту придбання.</p>
                <a name="imgs3"><h2>Музей Тіссен-Борнемісса</h2></a>
                <p>Як і багато монарші резиденції Європи, сьогодні Королівський палац використовується тільки для офіційних заходів, а в інший час відкритий для туристів та гостей. Будівля красиво само по собі, а всередині вражає вишуканими інтер'єрами і багатим зібранням творів мистецтва. Крім того, у палаці працює музей і оглядовий майданчик, звідки відкривається чудовий вид на місто.</p>
                <img style={{
                    display: 'flex', justifyContent: 'center', marginTop: 0, marginRight: 'auto',
                    marginBottom: '10px',
                    marginLeft: 'auto',
                }} src="https://tripmydream.cc/travelhub/travel/block_gallery/90/363/default_90363.jpg?" alt="" />
                <p>Побачити, як жили іспанські монархи, можна щодня з 09:30 до 17:00 (жовтень – березень) і з 09:00 до 18:00 (квітень – вересень). Вхідний квиток коштує €10 (дорослий) і €5 (дитячий).

                    Адреса: Calle de Bailén, s/n, 28071 Madrid.</p>
            </section>
        </main>
    )
}